name: "scale_full_003"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 1
      dim: 2048
      dim: 2
    }
  }
}
layer {
  name: "layer1"
  type: "Scale"
  bottom: "data"
  top: "layer1"
  scale_param {
    axis: -1
    num_axes: -1
    bias_term: true
  }
}
