name: "scale_full_008"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 2
      dim: 3
      dim: 4
    }
  }
}
layer {
  name: "layer1"
  type: "Scale"
  bottom: "data"
  top: "layer1"
  scale_param {
    axis: 1
    num_axes: 3
    bias_term: true
  }
}
